# First print your name in the cell below then save this file. (or something nice about your instructor)

In [1]:
# In this cell print your name 

print("Qingquan Li")

Qingquan Li

# Data wrangling with Pandas exercise
* For this exercise we will be using the `listings.csv` data file.

In [3]:
import pandas as pd
import numpy as np

# Load in the data file using `pd.read_csv()`

In [4]:
# Load data here

# listings.csv sample:
# id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
# 2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,175,3,48,2019-11-04,0.37,2,365
# 3831,"Whole flr w/private bdrm, bath & kitchen(pls read)",4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,75,1,340,2020-08-01,4.75,1,265
df_listings = pd.read_csv('../data/listings.csv')

## Exercise 2 - Filtering

Return the following subsets of the dataframe.

1. How many listings are there with a price less than 100? 


2. Find how many listings there are in just Brooklyn.


3. Find how many listings there are in Brooklyn with a price less than 100.


4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.


5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  The prices for all other listings should be the same as the were before. 


6. What % of the rooms are private, and what % of the rooms are shared.  
    * Hint, use `.value_counts()`

In [5]:
# 1. How many listings are there with a price less than 100? 

df_listings[df_listings['price'] < 100].shape[0]

22778

In [6]:
# 2. Make a new DataFrame of listings in Brooklyn named `df_bk` 
# and find how many listings in just Brooklyn.

df_bk = df_listings[df_listings['neighbourhood_group'] == 'Brooklyn']
df_bk.shape[0]

18632

In [7]:
# 3. Find how many listings there are in Brooklyn with a price less than 100.

df_bk[df_bk['price'] < 100].shape[0]

10473

In [10]:
# 4. Using `.isin()` select anyone that has the host name of Michael, David, John, and Daniel.
# How many total are there that have those names

names = ['Michael', 'David', 'John', 'Daniel']
filtered = df_listings[df_listings['host_name'].isin(names)]
filtered.shape[0]

1258

In [12]:
# 5. Create a new column called `adjusted_price` that has $100 added to every listing in Williamsburg.  
# The prices for all other listings should be the same as the were before. 

df_listings['adjusted_price'] = df_listings['price']
df_listings.loc[df_listings['neighbourhood'] == 'Williamsburg', 'adjusted_price'] += 100

In [13]:
# 6. What % of the rooms are private, and what % of the rooms are shared.  

private_rooms = df_listings[df_listings['room_type'] == 'Private room'].shape[0]
shared_rooms = df_listings[df_listings['room_type'] == 'Shared room'].shape[0]
total_rooms = private_rooms + shared_rooms

private_percentage = (private_rooms / total_rooms * 100) if total_rooms > 0 else 0
shared_percentage = (shared_rooms / total_rooms * 100) if total_rooms > 0 else 0

private_percentage, shared_percentage

(95.54019249017216, 4.459807509827844)

# Exercise 3 - Grouping

1. Using `groupby`, count how many listings are in each neighbourhood_group.


2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 


3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 


4. Using `groupby`, find the median price for each room type in each neighbourhood_group.


5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices for each room type in each neighbourhood_group.

In [14]:
# 1. Using `groupby`, count how many listings are in each neighbourhood_group.

df_listings.groupby('neighbourhood_group').size()

neighbourhood_group
Bronx             1183
Brooklyn         18632
Manhattan        20580
Queens            5791
Staten Island      341
dtype: int64

In [15]:
# 2. Using `groupby`, find the mean price for each of the neighbourhood_groups. 

df_listings.groupby('neighbourhood_group')['price'].mean()

neighbourhood_group
Bronx             92.751479
Brooklyn         120.225258
Manhattan        191.880466
Queens            99.754965
Staten Island    110.947214
Name: price, dtype: float64

In [16]:
# 2.5. Using `groupby`, find the mean price for each room_type. 

df_listings.groupby('room_type')['price'].mean()

room_type
Entire home/apt    199.395950
Hotel room         275.015075
Private room        91.453084
Shared room         87.063830
Name: price, dtype: float64

In [21]:
# 3. Using `groupby` and `.agg()`, find the min and max price for each of the neighbourhood_groups. 

df_listings.groupby('neighbourhood_group')['price'].agg(['min', 'max'])

                     min    max
neighbourhood_group
Bronx                 16   1404
Brooklyn               0  10000
Manhattan              0  10000
Queens                 0  10000
Staten Island         19   1200

In [22]:
# 4. Using `groupby`, find the mean price for each room_type in each neighbourhood_group.

df_listings.groupby(['neighbourhood_group', 'room_type'])['price'].mean().reset_index()

   neighbourhood_group        room_type       price
0                Bronx  Entire home/apt  138.004819
1                Bronx     Private room   68.419668
2                Bronx      Shared room   66.391304
3             Brooklyn  Entire home/apt  171.587687
4             Brooklyn       Hotel room  147.300000
5             Brooklyn     Private room   71.291189
6             Brooklyn      Shared room   57.870091
7            Manhattan  Entire home/apt  231.335572
8            Manhattan       Hotel room  292.515670
9            Manhattan     Private room  128.277069
10           Manhattan      Shared room  111.735084
11              Queens  Entire home/apt  150.168900
12              Queens       Hotel room  139.058824
13              Queens     Private room   69.972564
14              Queens      Shared room   89.891892
15       Staten Island  Entire home/apt  151.720930
16       Staten Island     Private room   70.312883
17       Staten Island      Shared room   46.000000

In [26]:
# 5. Using `groupby` and `.agg()`, find the count, min, max, mean, median, and std of the prices 
# for each room type in each neighbourhood_group.

df_listings.groupby(['neighbourhood_group', 'room_type'])['price'].agg(['count', 'min', 'max', 'mean', 'median', 'std']).reset_index()

,neighbourhood_group,room_type,count,min,max,mean,median,std
0,Bronx,Entire home/apt,415,25,1404,138.004819,103.0,126.032106
1,Bronx,Private room,722,16,700,68.419668,55.0,57.337866
2,Bronx,Shared room,46,20,800,66.391304,44.0,114.442703
3,Brooklyn,Entire home/apt,9112,20,10000,171.587687,135.0,236.732843
4,Brooklyn,Hotel room,30,0,399,147.300000,129.0,91.153206
5,Brooklyn,Private room,9159,10,2500,71.291189,60.0,69.023165
6,Brooklyn,Shared room,331,15,1500,57.870091,36.0,92.217618
7,Manhattan,Entire home/apt,12209,0,10000,231.335572,165.0,410.306439
8,Manhattan,Hotel room,351,0,2211,292.515670,210.0,315.924085
9,Manhattan,Private room,7601,10,10000,128.277069,80.0,448.677306
10,Manhattan,Shared room,419,10,10000,111.735084,60.0,502.728868
11,Queens,Entire home/apt,2090,10,10000,150.168900,115.0,252.606739
12,Queens,Hotel room,17,0,249,139.058824,149.0,50.743806
13,Queens,Private room,3499,18,9000,69.972564,55.0,163.814468
14,Queens,Shared room,185,14,3000,89.891892,40.0,275.675158
15,Staten Island,Entire home/apt,172,39,1200,151.720930,111.0,147.518392
16,Staten Island,Private room,163,20,800,70.312883,55.0,70.759593
17,Staten Island,Shared room,6,19,82,46.000000,38.0,28.446441

# Load, Merge, and Export files.
1. Load the `prices.csv` and the `n_listings.csv`
    * Having an error..? Inspect the actual csv file if you're having trouble

2. Do join that keeps all the records for each table.
    * Neighbourhood groups should include ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island',
       'LongIsland']

       
3. Save your joined csv as `joined.csv` into the data folder. 


4. Load your saved table and see if it looks the same or different that the DataFrame you used to create it.

In [32]:
# 1. Load the `prices.csv` and the `n_listings.csv`

# prices.csv:
# neighbourhood_group, mean_price
# Bronx, 92.75147928994083
# Brooklyn, 120.22525762129669
# Manhattan, 191.8804664723032
# Queens, 99.75496460024175
# Staten Island, 110.94721407624634

# n_listings.csv:
# neighbourhood_group;n_listings
# Bronx;1183
# Brooklyn;18632
# Manhattan;20580
# LongIsland;4121

df_prices = pd.read_csv('../data/prices.csv')
# df_n_listings = pd.read_csv('../data/n_listings.csv')
df_n_listings = pd.read_csv('../data/n_listings.csv', sep=';')

In [34]:
# 2. Do join that keeps all the records for each table.

df_joined = pd.merge(df_prices, df_n_listings, on='neighbourhood_group', how='outer')

In [44]:
# 3. Save your joined csv as `joined.csv` into the data folder. 

df_joined.to_csv('../data/joined.csv', index=False)

In [45]:
# 4. Load your newly saved file, see if it looks the same.  If not, try saving with argument `index=False`

# read and output the joined.csv
pd.read_csv('../data/joined.csv')

  neighbourhood_group   mean_price  n_listings
0               Bronx    92.751479      1183.0
1            Brooklyn   120.225258     18632.0
2          LongIsland          NaN      4121.0
3           Manhattan   191.880466     20580.0
4              Queens    99.754965         NaN
5       Staten Island   110.947214         NaN

# Extra Credit
Every question below this cell is extra credit and optional.

### 1. (Easy) Explore this new PandasAI Package and tell me what its all about because I've never used it. 
* https://www.youtube.com/watch?v=5w6eZaoDVVk&ab_channel=CodingIsFun  
* See if you can use it on the listings.csv to find out some cool info. or answer some of the questions above.

### 2. (Very Easy) Find other cool Panda packages / add ons and show us what they can do well. And how you installed them.

### 3. (Medium) Use the grammys.csv data for the next section of questions.

1. Who was won Album of the Year in 2016?


2. Who won Best Rap Album in 2009?


3. How many awards was Kendrick Lamar nomiated for, and how many did he win...?

### (Hard) Load the Game Logs for 2022 and add the column names using a dictionary.  
* [Link to the data page](https://www.retrosheet.org/gamelogs/)
* [Link to the column names](https://procatinator.com/)
* haha, gotta find them yourself!

### (Extra Hard) Download the files for the past 5 years into a new folder and add them all into one data frame using pandas, then save that new file.
* Try to not hard code in the file names. We want to do this programmatically because what if we want to add new/more file names in the future.